In [2]:
import pandas as pd

In [3]:
#Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
pd.Series(data=[4,8,15,16,23,42])

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [5]:
#Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
 #variable print it.

In [6]:
l=[4,8,15,16,23,42]

In [7]:
pd.Series(data=l)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [8]:
#Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
Data={'Name':["Alice","Bob","Claire"],
      'Age':[20,30,27],
      'Gender':['Female','Male','Female']}

In [10]:
pd.DataFrame(Data)

     Name  Age  Gender
0   Alice   20  Female
1     Bob   30    Male
2  Claire   27  Female

In [11]:
#Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [12]:
#A DataFrame in pandas is a two-dimensional labeled data structure
#that is commonly used for data manipulation and analysis in Python...

#On the other hand, a pandas Series is a one-dimensional labeled array that can hold any data type.
#It is similar to a column in a DataFrame.

In [13]:
#Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#you give an example of when you might use one of these functions?

In [14]:
# 1. Sorting values (df.sort_values)
# 2.  df.groupby()
# 3. df.merge()
# 4 df.apply()

In [15]:
Data1={'Name':["Alice","Bob","Claire"],
      'Age':[20,30,27],
      'Gender':['Female','Male','Female']}
Data2={'Name':["Alice","Bob","Claire"],
      'Age':[20,30,27],
      'Gender':['male','Male','male']}

In [16]:
d1=pd.DataFrame(Data1)

In [17]:
d2=pd.DataFrame(Data2)

In [22]:
d1.merge(d2,how='cross')

   Name_x  Age_x Gender_x  Name_y  Age_y Gender_y
0   Alice     20   Female   Alice     20     male
1   Alice     20   Female     Bob     30     Male
2   Alice     20   Female  Claire     27     male
3     Bob     30     Male   Alice     20     male
4     Bob     30     Male     Bob     30     Male
5     Bob     30     Male  Claire     27     male
6  Claire     27   Female   Alice     20     male
7  Claire     27   Female     Bob     30     Male
8  Claire     27   Female  Claire     27     male

In [23]:
#Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [24]:
# Among the options given (Series, DataFrame, Panel), only the DataFrame 
# is mutable in nature. This means that you can modify the content of a
# DataFrame after it has been created. You can add or remove columns, change values,
# and perform various other operations that alter the structure and data within a DataFrame.

In [25]:
#Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
names = pd.Series(['Gaurav', 'Praveen', 'Harsh', 'David'])
ages = pd.Series([21, 22, 20, 23])
grades = pd.Series([85, 92, 78, 89])

In [28]:
Student_data=pd.DataFrame({'Name':names,
                          'Age':ages,
                          'Grade':grades})

In [29]:
Student_data

      Name  Age  Grade
0   Gaurav   21     85
1  Praveen   22     92
2    Harsh   20     78
3    David   23     89